In [3]:
import pandas as pd
pd.set_option("display.max_column", None)

In [5]:
df = pd.read_csv("../../../production_data/raw_data_dump/companies.csv")
df.sample(2)

,_id,name,organization_size,company_type,created_at,updated_at,is_deleted
13,683ee19fb72469b8444e42f8,F comany,51-200,enterprise,2025-06-03 11:50:55.490,2025-06-03 11:50:55.490,False
32,68513789c939b52e8b71ad05,internal-company,1-10,small-business,2025-06-17 09:38:17.624,2025-06-17 09:38:17.624,False

In [6]:
print("shape: ", df.shape)
print("Columns: ", df.columns)

shape:  (33, 7)
Columns:  Index(['_id', 'name', 'organization_size', 'company_type', 'created_at',
       'updated_at', 'is_deleted'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   _id                33 non-null     object
 1   name               33 non-null     object
 2   organization_size  33 non-null     object
 3   company_type       33 non-null     object
 4   created_at         33 non-null     object
 5   updated_at         33 non-null     object
 6   is_deleted         33 non-null     bool
dtypes: bool(1), object(6)
memory usage: 1.7+ KB

In [8]:
df['is_deleted'].value_counts()

is_deleted
False    33
Name: count, dtype: int64

In [12]:
df['organization_size'].value_counts()

organization_size
200+      11
51-200     9
1-10       7
11-50      6
Name: count, dtype: int64

In [13]:
df['company_type'].value_counts()

company_type
corporation       9
startup           6
manufacturing     5
enterprise        5
small-business    4
ecommerce         1
consulting        1
freelance         1
non-profit        1
Name: count, dtype: int64

In [9]:
df[['name']].count()

name    33
dtype: int64

In [ ]:
df[['name']]

In [ ]:
filtered_df = df[df['organization_size'] == '11-50'][['name']]
filtered_df

                    name
0        Klizo Solutions
7           Demo Company
16        Demo Company 2
21  Ad officia sed velit
24     New Company Names
31    Veniam at illum vo

In [16]:
filtered_df = df[df['organization_size'] == '11-50'][['name', 'company_type']]
filtered_df

                    name    company_type
0        Klizo Solutions     corporation
7           Demo Company  small-business
16        Demo Company 2     corporation
21  Ad officia sed velit     corporation
24     New Company Names      enterprise
31    Veniam at illum vo   manufacturing

SELECT organization_size, name FROM df GROUP BY organization_size ORDER BY name DESC

In [ ]:
df_sorted = df.sort_values(by='name', ascending=False)
df_sorted

In [18]:
df_grouped = df_sorted.groupby('organization_size').first().reset_index()
df_grouped

,organization_size,_id,name,company_type,created_at,updated_at,is_deleted
0,1-10,68513789c939b52e8b71ad05,internal-company,small-business,2025-06-17 09:38:17.624,2025-06-17 09:38:17.624,False
1,11-50,684ea957c939b52e8b71ac3c,Veniam at illum vo,manufacturing,2025-06-15 11:07:03.616,2025-06-15 11:07:03.616,False
2,200+,681c86b51cf44d32fe030963,Vietnam Australia International School,corporation,2025-05-08 10:25:57.981,2025-05-08 10:25:57.981,False
3,51-200,6840858aa060d5257c9c3d6d,Quality Analyst Company,startup,2025-06-04 17:42:34.068,2025-06-04 17:42:34.068,False

In [19]:
df_result = df_grouped[['organization_size', 'name']]
df_result

  organization_size                                    name
0              1-10                        internal-company
1             11-50                      Veniam at illum vo
2              200+  Vietnam Australia International School
3            51-200                 Quality Analyst Company

In [23]:
df_result = df[['organization_size', 'name']].sort_values(by='organization_size', ascending=False)
df_result

   organization_size                                    name
11            51-200                      ESCO Beach Vietnam
2             51-200                              Esco Beach
26            51-200                        Klizo Solutions2
6             51-200                      Production Company
18            51-200                    In magna dolore temp
8             51-200                              QA_Company
17            51-200                 Quality Analyst Company
10            51-200                                Klizo QA
13            51-200                                F comany
14              200+                                    Test
28              200+                            Test Company
29              200+                                 Testing
1               200+  Vietnam Australia International School
15              200+                  Apollo English Vietnam
25              200+                        Testuikji87k6j7i
12              200+                                 Show Me
30              200+                          Rooj's Company
5               200+            Singapore Internation School
4               200+                   Furama Resort Da Nang
3               200+                   Furarma Resort Danang
24             11-50                       New Company Names
31             11-50                      Veniam at illum vo
0              11-50                         Klizo Solutions
16             11-50                          Demo Company 2
21             11-50                    Ad officia sed velit
7              11-50                            Demo Company
23              1-10                    Demo Company Kolkata
22              1-10                           Einstein Tech
27              1-10                                   Klizo
20              1-10                          Demo Company 4
19              1-10                          Demo Company 3
9               1-10                             Bunny House
32              1-10                        internal-company